In [1]:
import numpy as np
import pandas as pd

In [2]:
sozluk1 = {"Isim": ["Ahmet","Mehmet","Zeynep","Atıl"],
          "Spor" : ["Koşu", "Yüzme", "Koşu", "Basketbol"],
           "Kalori":[100,200,300,400]}

In [3]:
dataFrame1 = pd.DataFrame(sozluk1,index = [0,1,2,3])

In [4]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basketbol     400

In [6]:
sozluk2 = {"Isim": ["Osman","Levent","Atlas","Fatma"],
          "Spor" : ["Koşu", "Yüzme", "Koşu", "Basketbol"],
           "Kalori":[200,100,50,300]}

In [13]:
dataFrame2 = pd.DataFrame(sozluk2,index = [4,5,6,7])
dataFrame2

     Isim       Spor  Kalori
4   Osman       Koşu     200
5  Levent      Yüzme     100
6   Atlas       Koşu      50
7   Fatma  Basketbol     300

In [14]:
sozluk3 = {"Isim": ["Osman","Levent","Atlas","Fatma"],
          "Spor" : ["Koşu", "Yüzme", "Badminton", "Tenis"],
           "Kalori":[300,400,500,250]}

In [16]:
dataFrame3 = pd.DataFrame(sozluk3,index = [8,9,10,11])
dataFrame3

      Isim       Spor  Kalori
8    Osman       Koşu     300
9   Levent      Yüzme     400
10   Atlas  Badminton     500
11   Fatma      Tenis     250

# concatenation

In [17]:
pd.concat([dataFrame1,dataFrame2,dataFrame3], axis = 0)

      Isim       Spor  Kalori
4    Osman       Koşu     100
5   Levent      Yüzme     200
6    Atlas       Koşu     300
7    Fatma  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     100
6    Atlas       Koşu      50
7    Fatma  Basketbol     300
8    Osman       Koşu     300
9   Levent      Yüzme     400
10   Atlas  Badminton     500
11   Fatma      Tenis     250

# Merge / Birleştirmek

In [22]:
mergesozluk = {"Isim": ["Ahmet", "Mehmet", "Zeynep","Atıl"],
               "Spor": ["Koşu", "Yüzme", "Koşu", "Basketbol"]}

In [23]:
mergeDataFrame1 = pd.DataFrame(mergesozluk)

In [26]:
mergeDataFrame1

     Isim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [24]:
mergesozluk2 = {"Isim": ["Ahmet", "Mehmet", "Zeynep","Atıl"],
               "Kalori": [100,200,150,250]}

In [25]:
mergeDataFrame2 = pd.DataFrame(mergesozluk2)

In [27]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     150
3    Atıl     250

In [28]:
pd.merge(mergeDataFrame1, mergeDataFrame2, on ="Isim")     #hangi kolon üzerinden işlem yapmak istediğimizi belirtiriz.

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     150
3    Atıl  Basketbol     250

In [32]:
maasSozluk = {"Isim": ["Atıl", "Zeynep", "Mehmet", "Ahmet"],
             "Departman": ["Yazılım", "Satış", "Pazarlama", "Yazılım"],
             "Maas": [200,300,400,500] }

In [33]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [34]:
maasDataFrame

     Isim  Departman  Maas
0    Atıl    Yazılım   200
1  Zeynep      Satış   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [35]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [36]:
maasDataFrame["Departman"].nunique()

3

In [37]:
maasDataFrame["Departman"].value_counts()

Yazılım      2
Satış        1
Pazarlama    1
Name: Departman, dtype: int64

In [39]:
def bruttenNete (maas):
    return maas * 0.66

In [40]:
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [41]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [55]:
Veri = { "Bölge": ["Marmara", "Anadolu","Anadolu","Anadolu","Karadeniz"],
         "Türkiye": ["İstanbul", "Ankara", "Sivas", "Kahramanmaraş", "Samsun"],
         "Plaka": [34,6,58,46,55]}

In [56]:
Harita = pd.DataFrame(Veri)

In [57]:
Harita

       Bölge        Türkiye  Plaka
0    Marmara       İstanbul     34
1    Anadolu         Ankara      6
2    Anadolu          Sivas     58
3    Anadolu  Kahramanmaraş     46
4  Karadeniz         Samsun     55

In [59]:
Harita.pivot_table(values = "Plaka", index = ["Bölge", "Türkiye"])

                         Plaka
Bölge     Türkiye
Anadolu   Ankara             6
          Kahramanmaraş     46
          Sivas             58
Karadeniz Samsun            55
Marmara   İstanbul          34

In [60]:
Harita.pivot_table(values = "Plaka", index = ["Bölge", "Türkiye"], aggfunc = np.sum)

                         Plaka
Bölge     Türkiye
Anadolu   Ankara             6
          Kahramanmaraş     46
          Sivas             58
Karadeniz Samsun            55
Marmara   İstanbul          34